Revit 2027 API
PipeSettings.GetPipeSettings Method
 Get the pipe settings of the project.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PipeSettings GetPipeSettings(
	Document document
)
Public Shared Function GetPipeSettings (
	document As Document
) As PipeSettings
public:
static PipeSettings^ GetPipeSettings(
	Document^ document
)
static member GetPipeSettings :
        document : Document -> PipeSettings
Parameters
document Document
 The document.
Return Value
PipeSettings
 The pipe settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace